#โปรแกรมแสดงข้อความต้อนรับนักศึกษา โดยรับชื่อ และชั้นปีทางแป้นพิมพ์แล้วแสดงข้อความต้อนรับ ดังนี้
#กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman"
#กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore"
#กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior"
#กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior"
#กรณีป้อน ปีอื่นๆ  แสดงข้อความ "Oh, no ...."

print('โปรแกรมแสดงข้อความต้อนรับนักศึกษา')
print('หากค่าปีกรณีอยู่ในระดับต่อไปนักศึกษาแสดงข้อความ "Oh, no ...."')

your_name = input('ป้อนชื่อ : ')
your_year = int(input('ป้อนชั้นปี : '))

if your_year == 1:
    print('สวัสดีค่ะ ชื่อคุณคือ',your_name,'กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman"')
elif your_year == 2:
    print('สวัสดีค่ะ ชื่อคุณคือ',your_name,'กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore"')
elif your_year == 3:
    print('สวัสดีค่ะ ชื่อคุณคือ',your_name,'กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior"')
elif your_year == 4:
    print('สวัสดีค่ะ ชื่อคุณคือ',your_name,'กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior"')
else:
    print('สวัสดีค่ะ ชื่อคุณคือ',your_name,'กรณีป้อนชั้นปีอื่นๆ  แสดงข้อความ "Oh, no ...."')
print('เรียนพร้อมเพื่อน จบพร้อมหมอเลยกดเลขอื่นหรอคราฟฟฟฟฟ')
