#assignment operator การกำหนดค่า คือ 
#การทำงานของ = คือเอาทางขวาไปใส่ทางซ้ซ้าย
#ยกเว้นเสียงแต่ว่า สิ่งที่อยู่ทางขาวมีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
#ตัวแปร (variable) เท่ากับ ข้อมูล(data) นิพจน์(expression)
#ตัวแปรคือชื่อที่เดฟตั้งขึ้นมาเอง ***
#การใช้งานตัวแปรคือเอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บอยู่มาใช้ **
score = 20 
fullname = 'bestty'
salary = input ('ป้อนเงินเดืิอน')
sum = 20+30
print("*******")
num = 10  
num += 10 #num = num + 10 
num -=10  #num = num - 10 
num *= 10 #num = num * 10 
num /= 10 #num = num / 10 
num %= 10 #num = num % 10 
num //= 10 #num = num // 10 
print(num)
print("*****************")
