#  กรณี 1 print() มีข้อมูลหลายประเภททำยังไง*** มี 4 วิิธี
# 1
print("hallo", 5555,'wow', 999 , 10+20 -5,152.875)
#2 ไม่มีเว้นวรรค ใช้ + (ข้อมูลที่ไม่ใช่ string ต้องทำให้เป็น string ใช้ฟังก์ชัน str())
print('hallo'+str)+'wow'+str(999)+str(True)+'hi'+str(10+20-5)+str(152.875)
print('hallo' +str(555)+' wow '+str(9999)+' '+str(True)+' hi ' +str(10+20-5)+' '+str(152.875))

#วิธีที่ 3 ใช้เมธอต format() โดยช้อมูลที่แสดงอยู่ในรูปของ string 
# (ข้อมูลที่ไม่ใช้ string ให้ใส่ใน()ของ format และตำแหน่งที่แสดงข้อมูลนั่นไม่ใส่{} แทน 
print('hello {} wow {} {} hi {} {}'.format(5555,999,True,10+20-5,125.875))
# index number 0 1 2 3 4 
print(' '.format('A','B','C','D','E'))
# วิธีที่ 4 ใช้ f+sting โดยข้อมูลที่แสดงอยู่ในรูปแบบของ sting โดยมี f อยู่ข้างหน้า
#(ข้อมูลที่ไม่ใช้ sting ให้เขียนใส่ {} ณ ตำแหน่งนั้นๆ เลย)

print(f'hallo (555) wow {999} {True} hi {10+20-5} {152.875}')
