#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์')
print('หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช')
print('หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน')
train_no = int(input('ป้อนรหัสสายรถเมล์ : '))
if train_no == 57:
    print('สาย  57 ไปปิ่นเกล้า บางขุนนนท์')
elif train_no == 71:
    print('สาย  71ไปหัวลำโพง เยาวราช')
elif train_no == 539:
    print('สาย  539 ไปอนุสวรีย์ชัย สามเสน')
else:
    print('คุณป้อนสายรถเมล์ที่สอบถาม')
print('ขอบคุณฮาฟฟฟฟฟฟที่ขึ้นรถเมย์ วันหลังเดินดีกว่าอ้วนน')