#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน
#และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้ ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
#ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 1% จากยอดขาย
#ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 3% จากยอดขาย
#ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 5% จากยอดขาย

print('โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
emp_id = int(input('ป้อนรหัสพนักงาน : '))
emp_name = input('ป้อนชื่อพนักงาน : ')
emp_salary = float(input('ป้อนจำนวนเงินซึ่งเป็นยอดขายของพนักงาน : '))
if emp_salary >= 1000:
    commission = 0
elif emp_salary >= 1001 and emp_salary <= 2000:
   commission = emp_salary*1/100
elif emp_salary >= 2001 and emp_salary <= 3000:
    commission = emp_salary*3/100
else:
    commission = emp_salary*5/100
print('รหัสพนักงาน',{emp_id},'ชื่อพนักงาน',{emp_name},'ค่าคอมมิชชั่นคิด',{emp_salary},'บาทของพนักงานมีค่าคอมมิชชั่นคิด',{commission},'บาท')
print(f'คุณป้อนจำนวนเงินซึ่งเป็นยอดขายของพนักงานค่าคอมมิชชั่นคิด {emp_salary} บาท')
print('ขอบคุณฮาฟฟฟฟฟฟ')
