#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ 
# หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์" 
#  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์"
#  โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"')
print('หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์"')

car_number = input('ป้อนทะเบียนรถ : ')
car_owner =int (input('ป้อนชื่อรถ : '))

if car_owner > 1000:
    print('รถทะเบียน {car_number}น้ำหนักรถผ่านเกณฑ์')
else:
    print('รถทะเบียน {car_number}น้ำหนักรถไม่ผ่านเกณฑ์')
