#control floew แบ่งเป็น 2 กลุ่ม รูปแบบการทำงาน / control statement แยกเป็น 2 กลุ่มเช่นกัน 
#1 selectiont / Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3แบบบย่อย 
#1.1 จริงทำ เท็จไม่ทำ พิศุจน์ตรวจสอบครั้งเดียว (if)
#1.2 พิสูจน์ครั้งเดียวเหมือนกัน  จริงทำ เท็จก็ทำ (if-else)
#1.3 พิศุจน์ตรวจสอบหลายครั้ง               
#2 loop/Iteration การทำซ้ำ ทำเป็นลูป แยกเป็น 2 แบบ 
#-รูัจำนวนครั้งในการทำซ้ำ
#-ไม่รู้จำนวนครั้งในการทำซ้ำ
# -while/for 
#***ต้องรู้จบ 

#*****statements ที่เกี่ยวกับ control flow คือ break continue  โดยเฉพาะ loop
