# โปรแกรมรับชื่อและปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 
# ขึ้นไป ให้แสดงข้อความว่า "คุณแก่แล้ว"หากไม่ถึงให้แสดงว่า  "คุณกำลังแก่แล้ว"
from datetime import datetime

print('โปรแกรมตรวจสอบวัยวุฒ')
print('หากค่าวัยวุฒมีค่าเกินกว่า 35 ให้แสดงข้อความว่า “คุณแก่แล้ว”')
print('หากค่าวัยวุฒน้อยกว่า 35 ให้แสดงข้อความว่า “คุณกำลังแก่แล้ว”')

your_name = input('ป้อนชื่อของคุณ : ')
your_yearborn = int(input('ป้อนปีเกิดของคุณ : '))  #intครอบ แปลงตั้งแต่ตอนต้น
your_age = (datetime.now().year+543)- your_yearborn 
print('-----------------')
if your_age >= 35 :
    print(f'คุณ  {your_name}อายุ{your_age} แก่แล้ว ด้อนวอรี่นะจ๊ะ')
else:
    print(f'คุณ  {your_name}อายุ{your_age} กำลังแก่แล้ว ด้อนวอรี่เหมือนกันนะจ๊ะ')

print('bye bye')
print('ei ei')